# Subnetting Lab - GNS3 Project
--------------
## üìå Overview
### A practical GNS3 project showcasing subnetting of a /24 network into /26 subnets, including router configurations, PC connectivity and switch setups.
---
## ü™¢ Topology
- **Subnetting:** 192.168.1.0/24 ‚û°Ô∏è 4 subnets (/26)
- **Routers:** R1, R2, R3
- **Switches:** Switch1, Switch2, Switch3
- **PCs:** PC1, PC2, PC3
---

## üíª IP Addressing Scheme

| Device | Interface |     IP Address     |   Subnet Mask   |     Purpose     |
|--------| --------- | ------------------ | --------------- | --------------- |
|   R1   |    f0/0   |   192.168.1.1      | 255.255.255.192 |   LAN for PC1   |
|   R1   |    f1/0   |   192.168.1.193    | 255.255.255.252 |   Link to R2    |
|   R2   |    f0/0   |   192.168.1.65     | 255.255.255.192 |   LAN for PC2   |
|   R2   |    f1/0   |   192.168.1.194    | 255.255.255.252 |   Link to R1    |
|   R2   |    f1/1   |   192.168.1.197    | 255.255.255.252 |   Link to R3    |
|   R3   |    f0/0   |   192.168.1.129    | 255.255.255.192 |   LAN for PC3   |
|   R3   |    f1/0   |   192.168.1.198    | 255.255.255.252 |   Link to R2    |
|   PC1  |    e0     |   192.168.1.2      | 255.255.255.192 |  Host in R1 LAN |
|   PC2  |    e0     |   192.168.1.66     | 255.255.255.192 |  Host in R2 LAN |
|   PC3  |    e0     |   192.168.1.130    | 255.255.255.192 |  Host in R3 LAN |

---
![Network Topology](./screenshots/Screenshot%202025-09-16%20193617.png)

## üîé Verification Commands
### 1. Check Interface Status
Command:- **show ip interface brief**
- ![Output R1 example](Lab-2/Screenshots/Screenshot%202025-09-16%20194315.png)


----
### 2. ARP Table
Command:- **show arp**
- Output R2 example:

---
### 3. Routing Table
Command:- **show ip route*
- Output R3 example:

 ---

 ### 4. End-to-End Connectivity
 ***PC1‚¨ÖÔ∏èPC2‚û°Ô∏èPC3***
Command:
- **ping 192.168.1.66**
- **trace 192.168.1.66**
- **ping 192.168.1.130**
- **trace 192.168.1.130**
  - Output: From PC1 to PC2 & PC3

---
### 5. Failure & Recovery Test
**Shutdwon** the link between R2‚¨ÖÔ∏è‚û°Ô∏èR3:
CMD:
- R2(config)#**interface fa1/1** /(int f1/1)
- R2(config)#**shutdown** /(shut)
  - Ping test (failed):
     - Output: Ping PC2 to Pc3
     - CMD: ping 192.168.1.130
**Recover** the link:
CMD:
- R2(config)#**no shutdown** /(no shut)
  - Ping test (successful):
  - Output:

---
